#+title: Modern Org Example
#+author: Daniel Mendler
#+filetags: :example:org:

This example Org file demonstrates the Org elements,
which are styled by =org-modern=.

Here is an equation:
\[
e^{i\pi} = -1
\sum_{i=0}^{i=n}{x^{i}}
\]
-----



* Blocks

#+begin_src emacs-lisp
  ;; Taken from the well-structured Emacs config by @oantolin.
  ;; Take a look at https://github.com/oantolin/emacs-config!
  (defun command-of-the-day ()
    "Show the documentation for a random command."
    (interactive)
    (let ((commands))
      (mapatoms (lambda (s)
                  (when (commandp s) (push s commands))))
      (describe-function
       (nth (random (length commands)) commands))))
#+end_src


#+begin_src calc
  taylor(sin(x),x=0,3)
#+end_src

#+results:
: pi x / 180 - 2.85779606768e-8 pi^3 x^3

#+BEGIN_SRC C
  printf("a|b\nc|d\n");
#+END_SRC

\begin{equation}                        % arbitrary environments,
x=\sqrt{b}                              % even tables, figures, etc
\end{equation}


src_begin calc
1+ 3
src_end






#+results:
| a | b |
| c | d |







